/*
 * Встроить в пользователя и, соответственно, доделать уведомления
 * 
 * 
 * Установить статус бана/предупреждений/ограничений пользователя
 * 
 * Автоматическая подписка, если чел долго смотрить стрим (мб как настройка/разрешение для этого)?
 * 
 * Запись сессий/ip-адрессов/устройств для безопасности
 * 
 * Доработать ключ стрима, на данный момент интересует сброс/замена ключа
 * 
 * Стоит ли делать отдельную модель стримера, которая будет веткой от пользователя 
 * (если пользователь не стример, то ноль, а если стример, то у него будут необходимые поля)???....
 * 
 * 
 * Удаление пользователя, наверное, лучше подумать на soft delete (останется в базе с пометкой и анонимизирован)
 * а не над полным удалением. УДАЛЕНИЕ ПОЛЬЗОВАТЕЛЯ НЕ РЕАЛИЗОВАНО!
 */
